<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class UsagesTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('usages')->delete();
        
        \DB::table('usages')->insert(array (
            0 => 
            array (
                'id' => 7,
                'title' => 'Производственные, взрывоопасные и складские помещения',
                'product_id' => 8,
                'created_at' => '2025-05-22 07:41:25',
                'updated_at' => '2025-05-22 07:41:25',
            ),
            1 => 
            array (
                'id' => 8,
                'title' => 'Спортивные залы, крытые стадионы, ангары, офисные здания, торговые залы, конференц-залы и др.',
                'product_id' => 8,
                'created_at' => '2025-05-22 07:41:25',
                'updated_at' => '2025-05-22 07:41:25',
            ),
            2 => 
            array (
                'id' => 9,
                'title' => 'Автосервисы, покрасочные камеры, помещения без пыли, аэропорты, вагоноремонтные депо и др.',
                'product_id' => 8,
                'created_at' => '2025-05-22 07:41:25',
                'updated_at' => '2025-05-22 07:41:25',
            ),
            3 => 
            array (
                'id' => 34,
                'title' => 'Жилые помещения – квартиры, дома, дачи, балконы.',
                'product_id' => 18,
                'created_at' => '2025-05-24 00:21:22',
                'updated_at' => '2025-05-24 00:21:22',
            ),
            4 => 
            array (
                'id' => 35,
                'title' => 'Коммерческие объекты – офисы, магазины, кафе, рестораны, гостиницы.',
                'product_id' => 18,
                'created_at' => '2025-05-24 00:21:22',
                'updated_at' => '2025-05-24 00:21:22',
            ),
            5 => 
            array (
                'id' => 36,
                'title' => 'Промышленные зоны – склады, цеха, автомойки, ангары, сельскохозяйственные объекты.',
                'product_id' => 18,
                'created_at' => '2025-05-24 00:21:22',
                'updated_at' => '2025-05-24 00:21:22',
            ),
            6 => 
            array (
                'id' => 37,
                'title' => 'Общественные здания – школы, больницы, спортзалы, вокзалы.',
                'product_id' => 18,
                'created_at' => '2025-05-24 00:21:22',
                'updated_at' => '2025-05-24 00:21:22',
            ),
            7 => 
            array (
                'id' => 38,
                'title' => 'Торговые центры и магазины : Защита входных групп от проникновения холода, обеспечение комфортной температуры для покупателей.',
                'product_id' => 19,
                'created_at' => '2025-05-24 00:38:05',
                'updated_at' => '2025-05-24 00:38:05',
            ),
            8 => 
            array (
                'id' => 39,
                'title' => 'Офисные здания и бизнес-центры : Эффективная защита лобби и входных дверей.',
                'product_id' => 19,
                'created_at' => '2025-05-24 00:38:05',
                'updated_at' => '2025-05-24 00:38:05',
            ),
            9 => 
            array (
                'id' => 40,
                'title' => 'Производственные помещения : Минимизация теплопотерь в крупных проемах, особенно в зимний период.',
                'product_id' => 19,
                'created_at' => '2025-05-24 00:38:05',
                'updated_at' => '2025-05-24 00:38:05',
            ),
            10 => 
            array (
                'id' => 41,
                'title' => 'Склады и логистические центры : Создание изоляции в местах погрузки/разгрузки товаров.',
                'product_id' => 19,
                'created_at' => '2025-05-24 00:38:05',
                'updated_at' => '2025-05-24 00:38:05',
            ),
            11 => 
            array (
                'id' => 42,
                'title' => 'Автосервисы и гаражи : Защита от сквозняков и поддержание оптимальной температуры для работы.',
                'product_id' => 19,
                'created_at' => '2025-05-24 00:38:05',
                'updated_at' => '2025-05-24 00:38:05',
            ),
            12 => 
            array (
                'id' => 43,
                'title' => 'Промышленные объекты: цеха, склады, ангары, производственные помещения',
                'product_id' => 20,
                'created_at' => '2025-05-24 00:52:55',
                'updated_at' => '2025-05-24 00:52:55',
            ),
            13 => 
            array (
                'id' => 44,
                'title' => 'Коммерческие помещения: торговые центры, офисы, выставочные залы',
                'product_id' => 20,
                'created_at' => '2025-05-24 00:52:55',
                'updated_at' => '2025-05-24 00:52:55',
            ),
            14 => 
            array (
                'id' => 45,
                'title' => 'Спортивные сооружения: бассейны, спортзалы, ледовые арены',
                'product_id' => 20,
                'created_at' => '2025-05-24 00:52:55',
                'updated_at' => '2025-05-24 00:52:55',
            ),
            15 => 
            array (
                'id' => 46,
                'title' => 'Общественные здания: вокзалы, аэропорты, школы, больницы',
                'product_id' => 20,
                'created_at' => '2025-05-24 00:52:55',
                'updated_at' => '2025-05-24 00:52:55',
            ),
            16 => 
            array (
                'id' => 47,
                'title' => 'Сельскохозяйственные объекты: теплицы, животноводческие комплексы',
                'product_id' => 20,
                'created_at' => '2025-05-24 00:52:55',
                'updated_at' => '2025-05-24 00:52:55',
            ),
            17 => 
            array (
                'id' => 48,
                'title' => 'Торговые центры и магазины: Обеспечение комфорта для посетителей и сотрудников.',
                'product_id' => 21,
                'created_at' => '2025-05-24 00:58:36',
                'updated_at' => '2025-05-24 00:58:36',
            ),
            18 => 
            array (
                'id' => 49,
                'title' => 'Спортивные сооружения: Контроль микроклимата в залах с высокими потолками.',
                'product_id' => 21,
                'created_at' => '2025-05-24 00:58:36',
                'updated_at' => '2025-05-24 00:58:36',
            ),
            19 => 
            array (
                'id' => 50,
                'title' => 'Производственные помещения: Решение задач по вентиляции и поддержанию температуры.',
                'product_id' => 21,
                'created_at' => '2025-05-24 00:58:36',
                'updated_at' => '2025-05-24 00:58:36',
            ),
        ));
        
        
    }
}